{"data":{"site":{"siteMetadata":{"title":"KNC - Blog","author":"Naga Chaitanya Konada"}},"markdownRemark":{"id":"1f9c8dc6-648a-5f0b-918b-bb06c17eed01","excerpt":"What am I talking about, you ask? Well, its about my work life, if you feel excited, read on… If you don’t care, feel free to read on anyway, coz you may relate…","html":"<h2>What am I talking about, you ask?</h2>\n<p>Well, its about my work life, if you feel excited, read on… If you don’t care, feel free to read on anyway, coz you may relate to it at some point.</p>\n<p><img src=\"https://images.unsplash.com/photo-1506718468845-7578aa47670b?ixlib=rb-1.2.1&#x26;auto=format&#x26;fit=crop&#x26;w=1500&#x26;q=80\" alt=\"Stack of grounded stones\"></p>\n<blockquote>\n<p>If you aint grounded, you aint rounded.</p>\n</blockquote>\n<p>I was as innocent during the later part of my B.Tech graduation days as anybody could think of. You know, even before that, in my junior college days, I used to not care knowing about the future, what might be the goal of a person finishing junior college in the discipline I was in (M.P.C - maths, physics and chemistry). All I cared about was the day-in day-out stuff, the momentary happiness. I could’t care less about the future as the days approached where others were very tense and skeptical. I just relaxed..</p>\n<p>Well, the attitude was simple. I will face my future when I get there, so I will have time to worry about it. So, why think about it. Well, now that I think about it, the philosophy sounds cool.</p>\n<blockquote>\n<p>The gurus of Indian and Telugu philosophical and spiritual realm really paved a good way for thinking positively and practically in my generation of students.</p>\n</blockquote>\n<p>So, I did not know that there was something called a degree college where I had to do my graduation. So, there was no question of knowing anything beyond that. I don’t remember now, but I was not having any idea how/why people work so hard when there were my age now. Well, not knowing was really helpful.</p>\n<p>I finally knew that the EAMCET entrance exam is a thing to plough yourself through to the Technical courses called Bachelor of Engineering (or Technology). Rest of the folks had to go for an ordinary degree. From where I come, there is still a wide divide between the 4 year long technical engineering degrees and the 3 year long regular degrees. The rift is pretty big in terms of how people treat you in society and even jobs mandated an engineering degree in some cases.</p>\n<p>So, I worked hard in the second year of my junior college, cracked the exam with a good state level rank (1224 out of 200000+ applicants) and joined the engineering college.</p>\n<p>When I was in the 3rd year of graduation, I started getting more information on what happens beyond the college. People either fetch jobs, or go for post-graduation. I was not sure how either of them would work. So, I waited. Then the campus hires happened and I cracked the interview and got an offer in a reputed Indian corporate company. I felt happy. </p>\n<h2>The Twist</h2>\n<p><img src=\"https://images.unsplash.com/photo-1516796248643-97015ffc715d?ixlib=rb-1.2.1&#x26;ixid=eyJhcHBfaWQiOjEyMDd9&#x26;auto=format&#x26;fit=crop&#x26;w=1500&#x26;q=80\" alt=\"Man facing the sun\"></p>\n<p>But, the twist was that I was a Mechanical Engineering student, the company that offered the job was known for its IT services. So, the next question was, what would I do in that job, was it going to be mechanical stuff or IT related stuff.</p>\n<p>I knew I had one more year to go before joining the company, so I had plenty of time to think about it. The seniors who joined companies started telling that the work is unrelated to what we learn. Some even discouraged going after the job, instead, tried motivating to go for post graduation.</p>\n<p>Well, the old laid-back friend in me told me, let the future come. I will face whatever that life gives me in the form of this job and I will take it. </p>\n<p>So, eventually I joined the job, it was dealing with software. I learned, whithered, bothered. At one point, I thought I might have taken a wrong step.</p>\n<h2>The wait-and-see game</h2>\n<blockquote>\n<p>Why do we call it the game of patience when it comes to life choices and jobs?!!</p>\n</blockquote>\n<p>There is no good way or bad way of doing things. It is always, how you respond to the outcomes of those things. Do you learn something, do you try to not repeat the mistakes, do you always shy away from challenges or do you persevere. </p>\n<p>Two sayings are useful here:</p>\n<blockquote>\n<p>Whatever you think, that you will definitely be.</p>\n</blockquote>\n<blockquote>\n<p>Even if it is unbearable pain, frequent exposure to challenges will make winning them second nature.</p>\n</blockquote>\n<p>Combine these two and you got yourself a <em>recipe for success</em>. There are always people who think they know better than anyone. Never even think about them. In fact, you always know better than anyone else, <strong>about yourself</strong>.</p>\n<p>Go through the path that will make you good at what you do. You will feel pain, you will be frustrated. Find options to mitigate the negative effect, there are plenty of them. Get yourself occupied with the thoughts of your goal. Make your goal your own, be one with it and the first rule above applies.</p>\n<p>If I want to be a good public speaker, the first thing I need to do is <strong>think myself as a good public speaker</strong>. Mind takes those thoughts as positive signals and like a mould, your mind gets the shape of those thoughts and without doubt you will become a good public speaker.</p>\n<p>I see people chill out, thinking that their job is just a way to pass time, spend with colleagues in meaningless chatter and go home convincing the managers that there is nothing to worry, whereas they don’t even know how to fix the issue themselves the next morning. It repeats, fooling around in cafes, whining about the bad hikes and bonus numbers, debating who would be the next boss in office, and politics of the country. </p>\n<p>All this waste of energy, oh my dear God, could as well be used in improving oneself. Why is it that they don’t care. They thought themselves as escapists, and future escapes from them, money and satisfaction escape from them and then finally life will be a daily struggle for existence.</p>\n<h2>Thinking wisely always pays-off</h2>\n<p>Finally, I wish I could always say more motivating things to help others, but everybody has a way of looking at life and the world. They won’t listen, you will be belittled. Those who listen though, will succeed. The formula is clear, <strong>take it or leave it, take it and you succeed, leave it and it leaves you.</strong>. My life is founded on the stones of being laid-back about future, taking the present seriously and always thinking about what I want to be in a conscious manner. Hope you do follow and control your thoughts too, because whatever you think, that you will definitely be.</p>\n<blockquote>\n<p><em>Don’t go after success, but go after excellence and then success comes searching for you.</em> — 3 Idiots movig</p>\n</blockquote>\n<p><img src=\"https://images.unsplash.com/38/awhCbhLqRceCdjcPQUnn_IMG_0249.jpg?ixlib=rb-1.2.1&#x26;ixid=eyJhcHBfaWQiOjEyMDd9&#x26;auto=format&#x26;fit=crop&#x26;w=967&#x26;q=80\" alt=\"Working on keyboard and mouse\"></p>","frontmatter":{"title":"The Well Rounded Position","date":"February 24, 2019","spoiler":"As I grew in my career as a professional, things seem to go as planned, or did they?!!🤔","banner":"https://images.unsplash.com/38/awhCbhLqRceCdjcPQUnn_IMG_0249.jpg?ixlib=rb-1.2.1&ixid=eyJhcHBfaWQiOjEyMDd9&auto=format&fit=crop&w=967&q=80"}}},"pageContext":{"slug":"/2019/February/well-rounded-position/","previous":{"fields":{"slug":"/2019/January/severe-back-pain/"},"frontmatter":{"title":"The Great Back Pain of 2019","path":"/2019/01/30/the-great-back-pain"}},"next":null}}